In [2]:
%load_ext sql

In [3]:
%sql sqlite:///library.db

Connecting to 'sqlite:///library.db'

In [5]:
%%sql
CREATE TABLE Catalog(
	item_id INTEGER PRIMARY KEY AUTOINCREMENT,
	item_type TEXT,
	title TEXT,
	publication_date DATE,
	author_or_artist TEXT,
	publisher TEXT
)

Running query in 'sqlite:///library.db'

++
||
++
++

In [6]:
%sql SELECT * FROM Catalog

Running query in 'sqlite:///library.db'

+---------+-----------+-------+------------------+------------------+-----------+
| item_id | item_type | title | publication_date | author_or_artist | publisher |
+---------+-----------+-------+------------------+------------------+-----------+
+---------+-----------+-------+------------------+------------------+-----------+

In [9]:
%%sql
CREATE TABLE User(
	user_id INTEGER PRIMARY KEY AUTOINCREMENT,
	first_name TEXT,
	last_name TEXT,
	date_of_birth DATE,
	address TEXT,
	phone_number TEXT,
	date_joined DATE,
	total_charge INTEGER
)

Running query in 'sqlite:///library.db'

++
||
++
++

In [25]:
%sql select * from user;

Running query in 'sqlite:///library.db'

+---------+------------+------------+---------------+---------------------------------------------+--------------+-------------+--------------+
| user_id | first_name | last_name  | date_of_birth |                   address                   | phone_number | date_joined | total_charge |
+---------+------------+------------+---------------+---------------------------------------------+--------------+-------------+--------------+
|    1    |   Steve    |    Jobs    |   2000-10-08  |              1234 Apple Street              | 803-263-3394 |  2012-08-13 |      0       |
|    2    |   Julius   |   Caesar   |   0100-07-12  |              00186 Rome, Italy              | 800-840-840  |  2023-03-15 |      0       |
|    3    |    Jeff    |   Mneme    |   2023-01-01  | 1870 Hyoksin Street, Pyongyang, North Korea | 123-456-7890 |  2024-05-07 |     9001     |
|    4    |    Igor    | Igorovich  |   1986-04-26  |  Chernobyl Exclusion Zone, Pripyat, Ukraine | 926-103-6752 |  2013-12-11 |      0       |
|    5    |  Anatoly   |  Dyatlov   |   1931-03-03  |             02000, Kyiv, Ukraine            | 900-318-6027 |  2020-12-13 |      0       |
|    6    |    Goku    | Dragonball |   1989-04-26  |              2515, Tokyo, Japan             | 813-352-5610 |  2019-07-18 |      0       |
|    7    |   Bingus   |   Floppa   |   0001-01-01  |             ISS, Low-Earth Orbit            | 252-186-0131 |  2025-03-06 |      0       |
|    8    | Alexander  |  TheGreat  |   0356-07-20  |           32306, Pella, Macedonia           | 210-071-4197 |  2023-06-10 |      0       |
|    9    |  Genghis   |    Khan    |   1162-04-15  |           5104, Khentii, Mongolia           | 976-117-5143 |  2017-08-18 |     2000     |
+---------+------------+------------+---------------+---------------------------------------------+--------------+-------------+--------------+

In [13]:
%%sql
CREATE TABLE Loan(
	loan_id INTEGER PRIMARY KEY AUTOINCREMENT,
    record_id INTEGER,
	user_id INTEGER,
	loan_date DATE,
	due_date DATE,
	return_date DATE,
	fine_charged INTEGER,
    FOREIGN KEY (record_id) REFERENCES Record(record_id) ON UPDATE CASCADE,
	FOREIGN KEY (user_id) REFERENCES User(user_id) ON UPDATE CASCADE
)

Running query in 'sqlite:///library.db'

++
||
++
++

In [15]:
%%sql
CREATE TABLE Event(
	event_id INTEGER PRIMARY KEY AUTOINCREMENT,
	event_name TEXT,
	event_type TEXT,
	event_location TEXT, -- Composite Attribute?
	age_range TEXT,
	event_time DATE
)

Running query in 'sqlite:///library.db'

++
||
++
++

In [17]:
%%sql
CREATE TABLE Employee(
	employee_id INTEGER PRIMARY KEY AUTOINCREMENT,
	employee_name TEXT,
	employee_dob DATE,
	phone_number TEXT,
	address TEXT,
	employement_date DATE,
	salary DOUBLE
)

Running query in 'sqlite:///library.db'

++
||
++
++

In [7]:
%%sql
CREATE TABLE Record(
	record_id INTEGER PRIMARY KEY AUTOINCREMENT,
    item_id INTEGER,
	available BOOLEAN,
    notes TEXT,
    FOREIGN KEY (item_id) REFERENCES Catalog(item_id) ON UPDATE CASCADE
)

Running query in 'sqlite:///library.db'

++
||
++
++

In [9]:
%%sql
CREATE TABLE Volunteer(
    employee_id INTEGER,
    user_id INTEGER,
    PRIMARY KEY (employee_id, user_id)
    FOREIGN KEY (employee_id) REFERENCES Employee(employee_id) ON UPDATE CASCADE,
    FOREIGN KEY (user_id) REFERENCES User(user_id) ON UPDATE CASCADE
)

Running query in 'sqlite:///library.db'

++
||
++
++

In [5]:
%%sql
INSERT INTO Catalog (item_id, item_type, title, publication_date, author_or_artist, publisher)
VALUES 
    (1, 'Book',     '1984',                             '1949-10-10', 'George Orwell',                    'Secker & Warburg'),
    (2, 'Book',     'To Kill a Mockingbird',            '1960-01-25', 'Harper Lee',                       'J.B. Lippincott & Co.'),
    (3, 'Magazine', 'National Geographic (June 2023)',  '1934-05-14', '',                                 'National Geographic Society'),
    (4, 'Journal',  'Nature (Vol. 600)',                '', '',                                 'Springer Nature'),
    (5, 'E-Book',   'Sapiens: A Brief History of Humankind', 2011, 'Yuval Noah Harari',          'Harper');

Running query in 'sqlite:///library.db'

RuntimeError: (sqlite3.OperationalError) table Catalog has no column named publication_year
[SQL: INSERT INTO Catalog (item_id, item_type, title, publication_year, author_name, publisher)
VALUES
    (1, 'Book',     '1984',                             1949, 'George Orwell',                    'Secker & Warburg'),
    (2, 'Book',     'To Kill a Mockingbird',            1960, 'Harper Lee',                       'J.B. Lippincott & Co.'),
    (3, 'Magazine', 'National Geographic (June 2023)',  2023, '',                                 'National Geographic Society'),
    (4, 'Journal',  'Nature (Vol. 600)',                2022, '',                                 'Springer Nature'),
    (5, 'E-Book',   'Sapiens: A Brief History of Humankind', 2011, 'Yuval Noah Harari',          'Harper');]
(Background on this error at: https://sqlalche.me/e/20/e3q8)
If you need help solving this issue, send us a message: https://ploomber.io/community

In [5]:
%%sql
INSERT INTO Catalog (item_id, item_type, title, publication_date, author_or_artist, publisher)
VALUES 
    (1, 'Book',     '1984',                             '1949-10-10', 'George Orwell',                    'Secker & Warburg'),
    (2, 'Book',     'To Kill a Mockingbird',            '1960-01-25', 'Harper Lee',                       'J.B. Lippincott & Co.'),
    (3, 'Magazine', 'National Geographic (June 2023)',  '1934-05-14', '',                                 'National Geographic Society'),
    (4, 'Journal',  'Nature (Vol. 600)',                '', '',                                 'Springer Nature'),
    (5, 'E-Book',   'Sapiens: A Brief History of Humankind', 2011, 'Yuval Noah Harari',          'Harper');

Running query in 'sqlite:///library.db'

RuntimeError: (sqlite3.OperationalError) table Catalog has no column named publication_year
[SQL: INSERT INTO Catalog (item_id, item_type, title, publication_year, author_name, publisher)
VALUES
    (1, 'Book',     '1984',                             1949, 'George Orwell',                    'Secker & Warburg'),
    (2, 'Book',     'To Kill a Mockingbird',            1960, 'Harper Lee',                       'J.B. Lippincott & Co.'),
    (3, 'Magazine', 'National Geographic (June 2023)',  2023, '',                                 'National Geographic Society'),
    (4, 'Journal',  'Nature (Vol. 600)',                2022, '',                                 'Springer Nature'),
    (5, 'E-Book',   'Sapiens: A Brief History of Humankind', 2011, 'Yuval Noah Harari',          'Harper');]
(Background on this error at: https://sqlalche.me/e/20/e3q8)
If you need help solving this issue, send us a message: https://ploomber.io/community

In [15]:
%%sql
SELECT *
FROM Volunteer

Running query in 'sqlite:///library.db'

+-------------+---------+
| employee_id | user_id |
+-------------+---------+
+-------------+---------+

In [14]:
%%sql
DELETE
FROM Volunteer

Running query in 'sqlite:///library.db'

1 rows affected.

++
||
++
++